<?php

if(!defined('BOT')){
    http_response_code(403);
    include '../error!/403.html';
    die();
}

$lang['startMes'] = "היי, ".$name." ברוך הבא לבוט! אתה המנהל!
📬 כל ההודעות שישלחו לרובוט זה על ידי משתמשים, יועברו אליך.

📩 בכדי להשיב למשתמש, השב טקסט / מדיה בהשב להודעתו.

⛔️ הודעה חשובה!! חל איסור מוחלט להשתמש במערכת המשוב לדברים שאינם חוקיים!! ⛔

עזרה - /help

לפרטים נוספים פנו לתמיכה: @MashovSupport.";

$lang['successGroup'] = "הקבוצה הוגדרה בהצלחה!";

$lang['SystemMessage'] = "^הודעת מערכת^";

$lang['help'] = "/welcome - עריכת הודעת כניסה\n\n/admin - ניהול מנהלים\n\n/ban - ניהול חסימות של משתמשים\n\n/users - ניהול משתמשים\n\n/group - ניהול 'קבוצת ניהול'\n\n/sendMessageToAllUSers - שליחת הודעה לכל המשתמשים\n\n/sendFile - שליחת קבצים בלי העלאה מחדש";

$lang['welcome'] = "🆕 ניתן לשנות את הודעת הפתיחה (ההודעה הראשונה שתשלח למשתמש) באופן הבא: 

- שלח לרובוט את הפקודה \"הודעת פתיחה\". 
- שלח את תוכן ההודעה בהשב על פקודה זו.";

$lang['admin'] = "👮 תוכל להפוך משתמש למנהל ברובוט שלך על ידי שליחת \"הפוך למנהל\" בהשב להודעתו. 
✖️ על מנת לבטל את הרשאת הניהול של המשתמש שלח \"ביטול ניהול\" בהשב להודעתו. 

📄 ניתן לקבל את רשימת של המנהלים ברובוט על ידי שליחת הפקודה \"רשימת מנהלים\".";

$lang['group'] = "פיצ'ר קבוצה.

כאשר פיצ'ר הקבוצה מופעל, כל ההודעות שישלחו ברובוט יועברו לקבוצה וכל מי שיהיה בקבוצה יוכל לענות למשתמשים.

כאשר פיצ'ר הקבוצה כבוי, כל ההודעות שישלחו ברובוט ישלחו לכל המנהלים המוגדרים בבוט.

להפעלת הפיצ'ר יש לשלוח \"קבוצה\"

לכיבוי הפיצ'ר יש לשלוח \"מחיקת קבוצה\"";

$lang['ban'] = "🚫 על מנת לחסום משתמש - השב להודעתו \"חסום\". 
☑️על מנת לבטל את החסימה - השב \"ביטול חסימה\" על הודעת המשתמש.  

📄 ניתן לקבל את רשימת של המשתמשים החסומים ברובוט ע\"י שליחת הפקודה \"רשימת חסומים\".";

$lang['sendFile'] = "להעברת קובץ למשתמש בלי להעלות את הקובץ בהשב אליו יש:
1) לשלוח בהשב להודעת המשתמש את הפקודה /id
2) להעתיק את המספר שהתקבל
3) להשיב על הקובץ הרצוי את המספר המועתק";

$lang['groupError'] = "רק יוצר הבוט יכול לשנות את הגדרות הקבוצה";

$lang['users'] = "📄 ניתן לקבל את רשימת המשתמשים ברובוט על ידי שליחת הפקודה \"רשימת משתמשים\". \n\nניתן גם לקבל את רשימת המשתמשים הפעילים ברובוט (שלא חסומים ולא חסמו את הרובוט) ע\"י שליחת הפקודה \"רשימת משתמשים פעילים\"\n\nע\"י שליחת הפקודה \"משתמשים במספרים\" ניתן לקבל את הכמויות של המשתמשים במספרים";

$lang['replyCommand'] = "יש לשלוח את הפקודה הזו בהשב להודעת המשתמש";

$lang['credit'] = "\n\n➖➖➖➖➖➖➖➖➖\n⚡️ נוצר באמצעות @NewMashovBot!\n";

$lang['botBlocked'] = "שלום וברכה,
זוהי הודעת מערכת⚙️, בוט זה חסום⛔️ עקב דיווחים רבים של משתמשים👥 בנוגע להתחזות ופישינג🐠.

חושבים שחלה טעות? ניתן לפנות ל-@MashovSupport ונבדוק את הסיפור.
⚠️ הודעה חשובה: אנחנו לא מטפלים בפניות לא מכובדות ופניות דורשות ‼️.

כל טוב.";

$lang['creatorBlocked'] = "שלום וברכה,
זוהי הודעת מערכת⚙️, היוצר של בוט זה נחסם⛔️ במערכת עקב דיווחים רבים של משתמשים👥 בנוגע להתחזות ופישינג🐠.

חושבים שחלה טעות? ניתן לפנות ל-@MashovSupport ונבדוק את הסיפור.
⚠️ הודעה חשובה: אנחנו לא מטפלים בפניות לא מכובדות ופניות דורשות ‼️.

כל טוב.";

$lang['errorBlockAdmin'] = "שגיאה! לא ניתן לחסום מנהל...";

$lang['userAlreadyBlocked'] = "שגיאה! המשתמש כבר חסום...";

$lang['block'] = "חסום";

$lang['unblock'] = "ביטול חסימה";

$lang['sendMessageToAllUsersStep1'] = "אחלה 😁
שלח עכשיו בתגובה להודעה הזו את ההודעה שתרצה לשלוח לכל המשתמשים 😎 (כרגע ניתן לשלוח רק הודעה אחת בכל פעם, טקסט / תמונה / סרטון / מסמך וכו').

לביטול שלח: ביטול או cancel";

$lang['creatorOnlySendMessageToAllUsers'] = "רק היוצר יכול לשלוח הודעה לכל המשתמשים ☹️";

$lang['sendMessageToAllUsersDone'] = "ההודעה נשלחה בהצלחה לכל המשתמשים 😁

📊 סטטיסטיקות: 
📍 סה\"כ משתמשים: {1}
❌ משתמשים חדשים שחסמו את הרובוט: {2}";

$lang['sendMessageToAllUsersStart'] = "ההודעה נשלחת ברגעים אלו לכל המשתמשים 🚀";

$lang['cancelHe'] = "ביטול";

$lang['cancelEn'] = "cancel";

$lang['sendMessageToAllUsersCancel'] = "השליחה בוטלה";

$lang['sendMessageToAllUSers'] = "📣 ניתן לשלוח הודעה לכל המשתמשים ע\"י שליחת הפקודה \"הודעת תפוצה\"";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

$lang[] = "";

